Revit 2024 API
ParameterTypeId.ViewSolarstudyIsMultidayStudyType Property
 "Multi-day study"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ViewSolarstudyIsMultidayStudyType { get; }
Visual Basic
Public Shared ReadOnly Property ViewSolarstudyIsMultidayStudyType As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ViewSolarstudyIsMultidayStudyType {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace